Create mixed-type list and print contents.

In [1]:
li=[1,2.3,'Hello']
print(li)

[1, 2.3, 'Hello']

Import pandas and NumPy libraries.

In [2]:
import pandas as pd
import numpy as np

Load Data2.csv into a DataFrame and display it.

In [3]:
df=pd.read_csv('Data2.csv')
print(df)

    Country   Age  Gender Education   Salary Purchased   Review
0    France  44.0    Male        UG  72000.0        No     Poor
1     Spain  27.0  Female        PG  48000.0       Yes     Good
2   Germany  30.0    Male        UG  54000.0        No  Average
3   Germany  19.0     NaN    School  61000.0        No     Poor
4   Germany  40.0    Male        UG      NaN       Yes     Good
5    France  35.0  Female        PG  58000.0       Yes  Average
6     Spain   NaN    Male        UG  52000.0        No     Poor
7    France  48.0  Female        PG  79000.0       Yes     Good
8   Germany  50.0    Male        UG  83000.0        No  Average
9    France  37.0  Female        PG  67000.0       Yes     Poor
10    Spain  38.0    Male        UG  68000.0       Yes     Good
11  Germany  40.0  Female        PG  88000.0        No  Average
12   France  44.0    Male        UG  72000.0       Yes     Poor
13    Spain  18.0  Female    School  48000.0        No     Good

Show shape (rows, columns) of df.

In [4]:
df.shape

(14, 7)

List column labels of df.

In [5]:
df.columns

Index(['Country', 'Age', 'Gender', 'Education', 'Salary', 'Purchased',
       'Review'],
      dtype='object')

Show df.info method object without executing.

In [ ]:
df.info

Run df.info() to show column dtypes and null counts.

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    14 non-null     object
 1   Age        13 non-null     float64
 2   Gender     13 non-null     object
 3   Education  14 non-null     object
 4   Salary     13 non-null     float64
 5   Purchased  14 non-null     object
 6   Review     14 non-null     object
dtypes: float64(2), object(5)
memory usage: 916.0+ bytes

Compute descriptive statistics for numeric columns.

In [8]:
df.describe()

             Age        Salary
count  13.000000     13.000000
mean   36.153846  65384.615385
std    10.147628  13200.621586
min    18.000000  48000.000000
25%    30.000000  54000.000000
50%    38.000000  67000.000000
75%    44.000000  72000.000000
max    50.000000  88000.000000

Select the Age column as a DataFrame slice.

In [9]:
df[['Age']]

     Age
0   44.0
1   27.0
2   30.0
3   19.0
4   40.0
5   35.0
6    NaN
7   48.0
8   50.0
9   37.0
10  38.0
11  40.0
12  44.0
13  18.0

Calculate the mean of the Age column.

In [10]:
df[['Age']].mean()

Age    36.153846
dtype: float64

Sum the Salary column.

In [11]:
df[['Salary']].sum()

Salary    850000.0
dtype: float64

Show the first five rows of df.

In [12]:
df.head()

   Country   Age  Gender Education   Salary Purchased   Review
0   France  44.0    Male        UG  72000.0        No     Poor
1    Spain  27.0  Female        PG  48000.0       Yes     Good
2  Germany  30.0    Male        UG  54000.0        No  Average
3  Germany  19.0     NaN    School  61000.0        No     Poor
4  Germany  40.0    Male        UG      NaN       Yes     Good

Show the last five rows of df.

In [13]:
df.tail()

    Country   Age  Gender Education   Salary Purchased   Review
9    France  37.0  Female        PG  67000.0       Yes     Poor
10    Spain  38.0    Male        UG  68000.0       Yes     Good
11  Germany  40.0  Female        PG  88000.0        No  Average
12   France  44.0    Male        UG  72000.0       Yes     Poor
13    Spain  18.0  Female    School  48000.0        No     Good

Take a random sample of five rows.

In [14]:
df.sample(5)

    Country   Age  Gender Education   Salary Purchased   Review
0    France  44.0    Male        UG  72000.0        No     Poor
7    France  48.0  Female        PG  79000.0       Yes     Good
8   Germany  50.0    Male        UG  83000.0        No  Average
12   France  44.0    Male        UG  72000.0       Yes     Poor
11  Germany  40.0  Female        PG  88000.0        No  Average

Select the Country and Gender columns.

In [15]:
df[['Country','Gender']]

    Country  Gender
0    France    Male
1     Spain  Female
2   Germany    Male
3   Germany     NaN
4   Germany    Male
5    France  Female
6     Spain    Male
7    France  Female
8   Germany    Male
9    France  Female
10    Spain    Male
11  Germany  Female
12   France    Male
13    Spain  Female

Create df1 containing only Country and Gender.

In [16]:
df1=df[['Country','Gender']]

Show the shape of df1.

In [17]:
df1.shape

(14, 2)

Select all rows and columns using iloc.

In [18]:
df.iloc[:,:]

    Country   Age  Gender Education   Salary Purchased   Review
0    France  44.0    Male        UG  72000.0        No     Poor
1     Spain  27.0  Female        PG  48000.0       Yes     Good
2   Germany  30.0    Male        UG  54000.0        No  Average
3   Germany  19.0     NaN    School  61000.0        No     Poor
4   Germany  40.0    Male        UG      NaN       Yes     Good
5    France  35.0  Female        PG  58000.0       Yes  Average
6     Spain   NaN    Male        UG  52000.0        No     Poor
7    France  48.0  Female        PG  79000.0       Yes     Good
8   Germany  50.0    Male        UG  83000.0        No  Average
9    France  37.0  Female        PG  67000.0       Yes     Poor
10    Spain  38.0    Male        UG  68000.0       Yes     Good
11  Germany  40.0  Female        PG  88000.0        No  Average
12   France  44.0    Male        UG  72000.0       Yes     Poor
13    Spain  18.0  Female    School  48000.0        No     Good

Select all rows and first three columns with iloc.

In [19]:
df.iloc[:,0:3]

    Country   Age  Gender
0    France  44.0    Male
1     Spain  27.0  Female
2   Germany  30.0    Male
3   Germany  19.0     NaN
4   Germany  40.0    Male
5    France  35.0  Female
6     Spain   NaN    Male
7    France  48.0  Female
8   Germany  50.0    Male
9    France  37.0  Female
10    Spain  38.0    Male
11  Germany  40.0  Female
12   France  44.0    Male
13    Spain  18.0  Female

Select all rows except the last using iloc 0:-1.

In [20]:
df.iloc[0:-1]

    Country   Age  Gender Education   Salary Purchased   Review
0    France  44.0    Male        UG  72000.0        No     Poor
1     Spain  27.0  Female        PG  48000.0       Yes     Good
2   Germany  30.0    Male        UG  54000.0        No  Average
3   Germany  19.0     NaN    School  61000.0        No     Poor
4   Germany  40.0    Male        UG      NaN       Yes     Good
5    France  35.0  Female        PG  58000.0       Yes  Average
6     Spain   NaN    Male        UG  52000.0        No     Poor
7    France  48.0  Female        PG  79000.0       Yes     Good
8   Germany  50.0    Male        UG  83000.0        No  Average
9    France  37.0  Female        PG  67000.0       Yes     Poor
10    Spain  38.0    Male        UG  68000.0       Yes     Good
11  Germany  40.0  Female        PG  88000.0        No  Average
12   France  44.0    Male        UG  72000.0       Yes     Poor

Select all rows except the last using iloc :-1.

In [21]:
df.iloc[:-1]

    Country   Age  Gender Education   Salary Purchased   Review
0    France  44.0    Male        UG  72000.0        No     Poor
1     Spain  27.0  Female        PG  48000.0       Yes     Good
2   Germany  30.0    Male        UG  54000.0        No  Average
3   Germany  19.0     NaN    School  61000.0        No     Poor
4   Germany  40.0    Male        UG      NaN       Yes     Good
5    France  35.0  Female        PG  58000.0       Yes  Average
6     Spain   NaN    Male        UG  52000.0        No     Poor
7    France  48.0  Female        PG  79000.0       Yes     Good
8   Germany  50.0    Male        UG  83000.0        No  Average
9    France  37.0  Female        PG  67000.0       Yes     Poor
10    Spain  38.0    Male        UG  68000.0       Yes     Good
11  Germany  40.0  Female        PG  88000.0        No  Average
12   France  44.0    Male        UG  72000.0       Yes     Poor

Select the last column via iloc [:, -1].

In [22]:
df.iloc[:,-1]

0        Poor
1        Good
2     Average
3        Poor
4        Good
5     Average
6        Poor
7        Good
8     Average
9        Poor
10       Good
11    Average
12       Poor
13       Good
Name: Review, dtype: object

Slice rows 0-5 and columns 2-3 via iloc.

In [23]:
df.iloc[0:6,2:4]

   Gender Education
0    Male        UG
1  Female        PG
2    Male        UG
3     NaN    School
4    Male        UG
5  Female        PG

Select rows 0, 4, and 9 with columns 2-3 via iloc.

In [24]:
df.iloc[[0,4,9],2:4]

   Gender Education
0    Male        UG
4    Male        UG
9  Female        PG

Attempt Purchased value counts (typo value_count will raise an AttributeError).

In [25]:
df['Purchased'].value_count()

AttributeError: 'Series' object has no attribute 'value_count'

Count frequency of Purchased values correctly.

In [ ]:
df['Purchased'].value_counts()

Count frequency of Education values.

In [ ]:
df['Education'].value_counts()